thelemon22/regis/demo_projects/dsPIC33E/h/p33EP512MU814.h
extern volatile AUXCON6BITS AUXCON6bits __attribute__((__sfr__));

extern volatile unsigned int  PWMCON7 __attribute__((__sfr__));
__extension__ typedef struct tagPWMCON7BITS {
  union {
    struct {
      unsigned IUE:1;
      unsigned XPRES:1;
      unsigned CAM:1;
      unsigned MTBS:1;
      unsigned :1;
      unsigned DTCP:1;
      unsigned DTC:2;
      unsigned MDCS:1;
      unsigned ITB:1;
      unsigned TRGIEN:1;
      unsigned CLIEN:1;
      unsigned FLTIEN:1;
      unsigned TRGSTAT:1;
      unsigned CLSTAT:1;
      unsigned FLTSTAT:1;
    };
    struct {
      unsigned :6;
      unsigned DTC0:1;
      unsigned DTC1:1;
    };
  };
} PWMCON7BITS;
extern volatile PWMCON7BITS PWMCON7bits __attribute__((__sfr__));

extern volatile unsigned int  IOCON7 __attribute__((__sfr__));
__extension__ typedef struct tagIOCON7BITS {
  union {
    struct {
      unsigned OSYNC:1;
      unsigned SWAP:1;
      unsigned CLDAT:2;
      unsigned FLTDAT:2;
      unsigned OVRDAT:2;
      unsigned OVRENL:1;
      unsigned OVRENH:1;
      unsigned PMOD:2;
      unsigned POLL:1;
      unsigned POLH:1;
      unsigned PENL:1;
      unsigned PENH:1;
    };
    struct {
      unsigned :2;
      unsigned CLDAT0:1;
      unsigned CLDAT1:1;
      unsigned FLTDAT0:1;
      unsigned FLTDAT1:1;
      unsigned OVRDAT0:1;
      unsigned OVRDAT1:1;
      unsigned :2;
      unsigned PMOD0:1;
      unsigned PMOD1:1;
    };
  };
} IOCON7BITS;
extern volatile IOCON7BITS IOCON7bits __attribute__((__sfr__));

extern volatile unsigned int  FCLCON7 __attribute__((__sfr__));
__extension__ typedef struct tagFCLCON7BITS {
  union {
    struct {
      unsigned FLTMOD:2;
      unsigned FLTPOL:1;
      unsigned FLTSRC:5;
      unsigned CLMOD:1;
      unsigned CLPOL:1;
      unsigned CLSRC:5;
      unsigned IFLTMOD:1;
    };
    struct {
      unsigned FLTMOD0:1;
      unsigned FLTMOD1:1;
      unsigned :1;
      unsigned FLTSRC0:1;
      unsigned FLTSRC1:1;
      unsigned FLTSRC2:1;
      unsigned FLTSRC3:1;
      unsigned FLTSRC4:1;
      unsigned :2;
      unsigned CLSRC0:1;
      unsigned CLSRC1:1;
      unsigned CLSRC2:1;
      unsigned CLSRC3:1;
      unsigned CLSRC4:1;
    };
  };
} FCLCON7BITS;
extern volatile FCLCON7BITS FCLCON7bits __attribute__((__sfr__));

extern volatile unsigned int  PDC7 __attribute__((__sfr__));
extern volatile unsigned int  PHASE7 __attribute__((__sfr__));
extern volatile unsigned int  DTR7 __attribute__((__sfr__));
extern volatile unsigned int  ALTDTR7 __attribute__((__sfr__));
extern volatile unsigned int  SDC7 __attribute__((__sfr__));
extern volatile unsigned int  SPHASE7 __attribute__((__sfr__));
extern volatile unsigned int  TRIG7 __attribute__((__sfr__));
__extension__ typedef struct tagTRIG7BITS {
  union {
    struct {
      unsigned TRGCMP:16;
    };
    struct {
      unsigned :3;
      unsigned TRGCMP0:1;
      unsigned TRGCMP1:1;
      unsigned TRGCMP2:1;
      unsigned TRGCMP3:1;
      unsigned TRGCMP4:1;
      unsigned TRGCMP5:1;
      unsigned TRGCMP6:1;
      unsigned TRGCMP7:1;
      unsigned TRGCMP8:1;
      unsigned TRGCMP9:1;
      unsigned TRGCMP10:1;
      unsigned TRGCMP11:1;
      unsigned TRGCMP12:1;
    };
  };
} TRIG7BITS;
extern volatile TRIG7BITS TRIG7bits __attribute__((__sfr__));

extern volatile unsigned int  TRGCON7 __attribute__((__sfr__));
__extension__ typedef struct tagTRGCON7BITS {
  union {
    struct {
      unsigned TRGSTRT:6;
      unsigned :6;
      unsigned TRGDIV:4;
    };
    struct {
      unsigned TRGSTRT0:1;
      unsigned TRGSTRT1:1;
      unsigned TRGSTRT2:1;
      unsigned TRGSTRT3:1;
      unsigned TRGSTRT4:1;
      unsigned TRGSTRT5:1;
      unsigned :6;
      unsigned TRGDIV0:1;
      unsigned TRGDIV1:1;
      unsigned TRGDIV2:1;
      unsigned TRGDIV3:1;
    };
  };
} TRGCON7BITS;
extern volatile TRGCON7BITS TRGCON7bits __attribute__((__sfr__));

extern volatile unsigned int  PWMCAP7 __attribute__((__sfr__));
__extension__ typedef struct tagPWMCAP7BITS {
  union {
    struct {
      unsigned PWMCAP7:16;
    };
    struct {
      unsigned :3;
      unsigned PWMCAP10:1;
      unsigned PWMCAP11:1;
      unsigned PWMCAP12:1;
      unsigned PWMCAP13:1;
      unsigned PWMCAP14:1;
      unsigned PWMCAP15:1;
      unsigned PWMCAP16:1;
      unsigned PWMCAP17:1;
      unsigned PWMCAP18:1;
      unsigned PWMCAP19:1;
      unsigned PWMCAP110:1;
      unsigned PWMCAP111:1;
      unsigned PWMCAP112:1;
    };
  };
} PWMCAP7BITS;
extern volatile PWMCAP7BITS PWMCAP7bits __attribute__((__sfr__));

extern volatile unsigned int  LEBCON7 __attribute__((__sfr__));
typedef struct tagLEBCON7BITS {
  unsigned BPLL:1;
  unsigned BPLH:1;
  unsigned BPHL:1;
  unsigned BPHH:1;
  unsigned BCL:1;
  unsigned BCH:1;
  unsigned :4;
  unsigned CLLEBEN:1;
  unsigned FLTLEBEN:1;
  unsigned PLF:1;
  unsigned PLR:1;
  unsigned PHF:1;
  unsigned PHR:1;
} LEBCON7BITS;
extern volatile LEBCON7BITS LEBCON7bits __attribute__((__sfr__));

extern volatile unsigned int  LEBDLY7 __attribute__((__sfr__));
__extension__ typedef struct tagLEBDLY7BITS {
  union {
    struct {
      unsigned LEB:12;
    };
    struct {
      unsigned LEB0:1;
      unsigned LEB1:1;
      unsigned LEB2:1;
      unsigned LEB3:1;
      unsigned LEB4:1;
      unsigned LEB5:1;
      unsigned LEB6:1;
      unsigned LEB7:1;
      unsigned LEB8:1;
      unsigned LEB9:1;
      unsigned LEB10:1;
      unsigned LEB11:1;
    };
  };
} LEBDLY7BITS;
extern volatile LEBDLY7BITS LEBDLY7bits __attribute__((__sfr__));

extern volatile unsigned int  AUXCON7 __attribute__((__sfr__));
__extension__ typedef struct tagAUXCON7BITS {
  union {
    struct {
      unsigned CHOPLEN:1;
      unsigned CHOPHEN:1;
      unsigned CHOPSEL:4;
      unsigned :2;
      unsigned BLANKSEL:4;
    };
    struct {
      unsigned :2;
      unsigned CHOPSEL0:1;
      unsigned CHOPSEL1:1;
      unsigned CHOPSEL2:1;
      unsigned CHOPSEL3:1;
      unsigned :2;
      unsigned BLANKSEL0:1;
      unsigned BLANKSEL1:1;
      unsigned BLANKSEL2:1;
      unsigned BLANKSEL3:1;
    };
  };
} AUXCON7BITS;
extern volatile AUXCON7BITS AUXCON7bits __attribute__((__sfr__));

extern volatile unsigned int  TRISA __attribute__((__sfr__));
typedef struct tagTRISABITS {
  unsigned TRISA0:1;
  unsigned TRISA1:1;
  unsigned TRISA2:1;
  unsigned TRISA3:1;
  unsigned TRISA4:1;
  unsigned TRISA5:1;
  unsigned TRISA6:1;
  unsigned TRISA7:1;
  unsigned :1;
  unsigned TRISA9:1;
  unsigned TRISA10:1;
  unsigned :3;
  unsigned TRISA14:1;
  unsigned TRISA15:1;
} TRISABITS;
extern volatile TRISABITS TRISAbits __attribute__((__sfr__));

