thelemon22/regis/demo_projects/dsPIC33E/h/p33EP512MU814.h
/* PMMODE */
#define _WAITE PMMODEbits.WAITE
#define _WAITM PMMODEbits.WAITM
#define _WAITB PMMODEbits.WAITB
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _MODE16 cannot be defined because it is used by more than one SFR */
#define _INCM PMMODEbits.INCM
#define _IRQM PMMODEbits.IRQM
#define _BUSY PMMODEbits.BUSY
#define _WAITE0 PMMODEbits.WAITE0
#define _WAITE1 PMMODEbits.WAITE1
#define _WAITM0 PMMODEbits.WAITM0
#define _WAITM1 PMMODEbits.WAITM1
#define _WAITM2 PMMODEbits.WAITM2
#define _WAITM3 PMMODEbits.WAITM3
#define _WAITB0 PMMODEbits.WAITB0
#define _WAITB1 PMMODEbits.WAITB1
/* Bitname _MODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE1 cannot be defined because it is used by more than one SFR */
#define _INCM0 PMMODEbits.INCM0
#define _INCM1 PMMODEbits.INCM1
#define _IRQM0 PMMODEbits.IRQM0
#define _IRQM1 PMMODEbits.IRQM1

/* PMADDR */
#define _ADDR PMADDRbits.ADDR
#define _CS1 PMADDRbits.CS1
#define _CS2 PMADDRbits.CS2
#define _ADDR0 PMADDRbits.ADDR0
#define _ADDR1 PMADDRbits.ADDR1
#define _ADDR2 PMADDRbits.ADDR2
#define _ADDR3 PMADDRbits.ADDR3
#define _ADDR4 PMADDRbits.ADDR4
#define _ADDR5 PMADDRbits.ADDR5
#define _ADDR6 PMADDRbits.ADDR6
#define _ADDR7 PMADDRbits.ADDR7
#define _ADDR8 PMADDRbits.ADDR8
#define _ADDR9 PMADDRbits.ADDR9
#define _ADDR10 PMADDRbits.ADDR10
#define _ADDR11 PMADDRbits.ADDR11
#define _ADDR12 PMADDRbits.ADDR12
#define _ADDR13 PMADDRbits.ADDR13

/* PMAEN */
#define _PTEN0 PMAENbits.PTEN0
#define _PTEN1 PMAENbits.PTEN1
#define _PTEN2 PMAENbits.PTEN2
#define _PTEN3 PMAENbits.PTEN3
#define _PTEN4 PMAENbits.PTEN4
#define _PTEN5 PMAENbits.PTEN5
#define _PTEN6 PMAENbits.PTEN6
#define _PTEN7 PMAENbits.PTEN7
#define _PTEN8 PMAENbits.PTEN8
#define _PTEN9 PMAENbits.PTEN9
#define _PTEN10 PMAENbits.PTEN10
#define _PTEN11 PMAENbits.PTEN11
#define _PTEN12 PMAENbits.PTEN12
#define _PTEN13 PMAENbits.PTEN13
#define _PTEN14 PMAENbits.PTEN14
#define _PTEN15 PMAENbits.PTEN15

/* PMSTAT */
#define _OB0E PMSTATbits.OB0E
#define _OB1E PMSTATbits.OB1E
#define _OB2E PMSTATbits.OB2E
#define _OB3E PMSTATbits.OB3E
#define _OBUF PMSTATbits.OBUF
#define _OBE PMSTATbits.OBE
#define _IB0F PMSTATbits.IB0F
#define _IB1F PMSTATbits.IB1F
#define _IB2F PMSTATbits.IB2F
#define _IB3F PMSTATbits.IB3F
#define _IBOV PMSTATbits.IBOV
#define _IBF PMSTATbits.IBF

/* ALCFGRPT */
#define _ARPT ALCFGRPTbits.ARPT
#define _ALRMPTR ALCFGRPTbits.ALRMPTR
#define _AMASK ALCFGRPTbits.AMASK
#define _CHIME ALCFGRPTbits.CHIME
#define _ALRMEN ALCFGRPTbits.ALRMEN
#define _ARPT0 ALCFGRPTbits.ARPT0
#define _ARPT1 ALCFGRPTbits.ARPT1
#define _ARPT2 ALCFGRPTbits.ARPT2
#define _ARPT3 ALCFGRPTbits.ARPT3
#define _ARPT4 ALCFGRPTbits.ARPT4
#define _ARPT5 ALCFGRPTbits.ARPT5
#define _ARPT6 ALCFGRPTbits.ARPT6
#define _ARPT7 ALCFGRPTbits.ARPT7
#define _ALRMPTR0 ALCFGRPTbits.ALRMPTR0
#define _ALRMPTR1 ALCFGRPTbits.ALRMPTR1
#define _AMASK0 ALCFGRPTbits.AMASK0
#define _AMASK1 ALCFGRPTbits.AMASK1
#define _AMASK2 ALCFGRPTbits.AMASK2
#define _AMASK3 ALCFGRPTbits.AMASK3

/* RCFGCAL */
#define _CAL RCFGCALbits.CAL
#define _RTCPTR RCFGCALbits.RTCPTR
#define _RTCOE RCFGCALbits.RTCOE
#define _HALFSEC RCFGCALbits.HALFSEC
#define _RTCSYNC RCFGCALbits.RTCSYNC
#define _RTCWREN RCFGCALbits.RTCWREN
#define _RTCEN RCFGCALbits.RTCEN
#define _CAL0 RCFGCALbits.CAL0
#define _CAL1 RCFGCALbits.CAL1
#define _CAL2 RCFGCALbits.CAL2
#define _CAL3 RCFGCALbits.CAL3
#define _CAL4 RCFGCALbits.CAL4
#define _CAL5 RCFGCALbits.CAL5
#define _CAL6 RCFGCALbits.CAL6
#define _CAL7 RCFGCALbits.CAL7
#define _RTCPTR0 RCFGCALbits.RTCPTR0
#define _RTCPTR1 RCFGCALbits.RTCPTR1

/* CRCCON1 */
#define _LENDIAN CRCCON1bits.LENDIAN
#define _CRCGO CRCCON1bits.CRCGO
#define _CRCISEL CRCCON1bits.CRCISEL
#define _CRCMPT CRCCON1bits.CRCMPT
#define _CRCFUL CRCCON1bits.CRCFUL
#define _VWORD CRCCON1bits.VWORD
/* Bitname _CSIDL cannot be defined because it is used by more than one SFR */
#define _CRCEN CRCCON1bits.CRCEN
#define _VWORD0 CRCCON1bits.VWORD0
#define _VWORD1 CRCCON1bits.VWORD1
#define _VWORD2 CRCCON1bits.VWORD2
#define _VWORD3 CRCCON1bits.VWORD3
#define _VWORD4 CRCCON1bits.VWORD4

/* CRCCON2 */
#define _PLEN CRCCON2bits.PLEN
#define _DWIDTH CRCCON2bits.DWIDTH
#define _PLEN0 CRCCON2bits.PLEN0
#define _PLEN1 CRCCON2bits.PLEN1
#define _PLEN2 CRCCON2bits.PLEN2
#define _PLEN3 CRCCON2bits.PLEN3
#define _PLEN4 CRCCON2bits.PLEN4
#define _DWIDTH0 CRCCON2bits.DWIDTH0
#define _DWIDTH1 CRCCON2bits.DWIDTH1
#define _DWIDTH2 CRCCON2bits.DWIDTH2
#define _DWIDTH3 CRCCON2bits.DWIDTH3
#define _DWIDTH4 CRCCON2bits.DWIDTH4

/* CRCXORL */
#define _X1 CRCXORLbits.X1
#define _X2 CRCXORLbits.X2
#define _X3 CRCXORLbits.X3
#define _X4 CRCXORLbits.X4
#define _X5 CRCXORLbits.X5
#define _X6 CRCXORLbits.X6
#define _X7 CRCXORLbits.X7
#define _X8 CRCXORLbits.X8
#define _X9 CRCXORLbits.X9
#define _X10 CRCXORLbits.X10
#define _X11 CRCXORLbits.X11
#define _X12 CRCXORLbits.X12
#define _X13 CRCXORLbits.X13
#define _X14 CRCXORLbits.X14
#define _X15 CRCXORLbits.X15

/* CRCXORH */
#define _X16 CRCXORHbits.X16
#define _X17 CRCXORHbits.X17
#define _X18 CRCXORHbits.X18
#define _X19 CRCXORHbits.X19
#define _X20 CRCXORHbits.X20
#define _X21 CRCXORHbits.X21
#define _X22 CRCXORHbits.X22
#define _X23 CRCXORHbits.X23
#define _X24 CRCXORHbits.X24
#define _X25 CRCXORHbits.X25
#define _X26 CRCXORHbits.X26
#define _X27 CRCXORHbits.X27
#define _X28 CRCXORHbits.X28
#define _X29 CRCXORHbits.X29
#define _X30 CRCXORHbits.X30
#define _X31 CRCXORHbits.X31

/* RPOR0 */
#define _RP64R RPOR0bits.RP64R
#define _RP65R RPOR0bits.RP65R
#define _RP64R0 RPOR0bits.RP64R0
#define _RP64R1 RPOR0bits.RP64R1
#define _RP64R2 RPOR0bits.RP64R2
#define _RP64R3 RPOR0bits.RP64R3
#define _RP64R4 RPOR0bits.RP64R4
#define _RP64R5 RPOR0bits.RP64R5
#define _RP65R0 RPOR0bits.RP65R0
#define _RP65R1 RPOR0bits.RP65R1
#define _RP65R2 RPOR0bits.RP65R2
#define _RP65R3 RPOR0bits.RP65R3
#define _RP65R4 RPOR0bits.RP65R4
#define _RP65R5 RPOR0bits.RP65R5

/* RPOR1 */
#define _RP66R RPOR1bits.RP66R
#define _RP67R RPOR1bits.RP67R
#define _RP66R0 RPOR1bits.RP66R0
#define _RP66R1 RPOR1bits.RP66R1
#define _RP66R2 RPOR1bits.RP66R2
#define _RP66R3 RPOR1bits.RP66R3
#define _RP66R4 RPOR1bits.RP66R4
#define _RP66R5 RPOR1bits.RP66R5
#define _RP67R0 RPOR1bits.RP67R0
#define _RP67R1 RPOR1bits.RP67R1
#define _RP67R2 RPOR1bits.RP67R2
#define _RP67R3 RPOR1bits.RP67R3
#define _RP67R4 RPOR1bits.RP67R4
#define _RP67R5 RPOR1bits.RP67R5

/* RPOR2 */
#define _RP68R RPOR2bits.RP68R
#define _RP69R RPOR2bits.RP69R
#define _RP68R0 RPOR2bits.RP68R0
#define _RP68R1 RPOR2bits.RP68R1
#define _RP68R2 RPOR2bits.RP68R2
#define _RP68R3 RPOR2bits.RP68R3
#define _RP68R4 RPOR2bits.RP68R4
#define _RP68R5 RPOR2bits.RP68R5
#define _RP69R0 RPOR2bits.RP69R0
#define _RP69R1 RPOR2bits.RP69R1
#define _RP69R2 RPOR2bits.RP69R2
#define _RP69R3 RPOR2bits.RP69R3
#define _RP69R4 RPOR2bits.RP69R4
#define _RP69R5 RPOR2bits.RP69R5

/* RPOR3 */
#define _RP70R RPOR3bits.RP70R
#define _RP71R RPOR3bits.RP71R
#define _RP70R0 RPOR3bits.RP70R0
#define _RP70R1 RPOR3bits.RP70R1
#define _RP70R2 RPOR3bits.RP70R2
#define _RP70R3 RPOR3bits.RP70R3
#define _RP70R4 RPOR3bits.RP70R4
#define _RP70R5 RPOR3bits.RP70R5
#define _RP71R0 RPOR3bits.RP71R0
#define _RP71R1 RPOR3bits.RP71R1
#define _RP71R2 RPOR3bits.RP71R2
#define _RP71R3 RPOR3bits.RP71R3
#define _RP71R4 RPOR3bits.RP71R4
#define _RP71R5 RPOR3bits.RP71R5

/* RPOR4 */
#define _RP79R RPOR4bits.RP79R
#define _RP80R RPOR4bits.RP80R
#define _RP79R0 RPOR4bits.RP79R0
#define _RP79R1 RPOR4bits.RP79R1
#define _RP79R2 RPOR4bits.RP79R2
#define _RP79R3 RPOR4bits.RP79R3
#define _RP79R4 RPOR4bits.RP79R4
#define _RP79R5 RPOR4bits.RP79R5
#define _RP80R0 RPOR4bits.RP80R0
#define _RP80R1 RPOR4bits.RP80R1
#define _RP80R2 RPOR4bits.RP80R2
#define _RP80R3 RPOR4bits.RP80R3
#define _RP80R4 RPOR4bits.RP80R4
#define _RP80R5 RPOR4bits.RP80R5

/* RPOR5 */
#define _RP82R RPOR5bits.RP82R
#define _RP84R RPOR5bits.RP84R
#define _RP82R0 RPOR5bits.RP82R0
#define _RP82R1 RPOR5bits.RP82R1
#define _RP82R2 RPOR5bits.RP82R2
#define _RP82R3 RPOR5bits.RP82R3
#define _RP82R4 RPOR5bits.RP82R4
#define _RP82R5 RPOR5bits.RP82R5
#define _RP84R0 RPOR5bits.RP84R0
#define _RP84R1 RPOR5bits.RP84R1
#define _RP84R2 RPOR5bits.RP84R2
#define _RP84R3 RPOR5bits.RP84R3
#define _RP84R4 RPOR5bits.RP84R4
#define _RP84R5 RPOR5bits.RP84R5

/* RPOR6 */
#define _RP85R RPOR6bits.RP85R
#define _RP87R RPOR6bits.RP87R
#define _RP85R0 RPOR6bits.RP85R0
#define _RP85R1 RPOR6bits.RP85R1
#define _RP85R2 RPOR6bits.RP85R2
#define _RP85R3 RPOR6bits.RP85R3
#define _RP85R4 RPOR6bits.RP85R4
#define _RP85R5 RPOR6bits.RP85R5
#define _RP87R0 RPOR6bits.RP87R0
#define _RP87R1 RPOR6bits.RP87R1
#define _RP87R2 RPOR6bits.RP87R2
#define _RP87R3 RPOR6bits.RP87R3
#define _RP87R4 RPOR6bits.RP87R4
#define _RP87R5 RPOR6bits.RP87R5

