thelemon22/regis/demo_projects/dsPIC33E/h/p33EP512MU814.h
/* RPOR7 */
#define _RP96R RPOR7bits.RP96R
#define _RP97R RPOR7bits.RP97R
#define _RP96R0 RPOR7bits.RP96R0
#define _RP96R1 RPOR7bits.RP96R1
#define _RP96R2 RPOR7bits.RP96R2
#define _RP96R3 RPOR7bits.RP96R3
#define _RP96R4 RPOR7bits.RP96R4
#define _RP96R5 RPOR7bits.RP96R5
#define _RP97R0 RPOR7bits.RP97R0
#define _RP97R1 RPOR7bits.RP97R1
#define _RP97R2 RPOR7bits.RP97R2
#define _RP97R3 RPOR7bits.RP97R3
#define _RP97R4 RPOR7bits.RP97R4
#define _RP97R5 RPOR7bits.RP97R5

/* RPOR8 */
#define _RP98R RPOR8bits.RP98R
#define _RP99R RPOR8bits.RP99R
#define _RP98R0 RPOR8bits.RP98R0
#define _RP98R1 RPOR8bits.RP98R1
#define _RP98R2 RPOR8bits.RP98R2
#define _RP98R3 RPOR8bits.RP98R3
#define _RP98R4 RPOR8bits.RP98R4
#define _RP98R5 RPOR8bits.RP98R5
#define _RP99R0 RPOR8bits.RP99R0
#define _RP99R1 RPOR8bits.RP99R1
#define _RP99R2 RPOR8bits.RP99R2
#define _RP99R3 RPOR8bits.RP99R3
#define _RP99R4 RPOR8bits.RP99R4
#define _RP99R5 RPOR8bits.RP99R5

/* RPOR9 */
#define _RP100R RPOR9bits.RP100R
#define _RP101R RPOR9bits.RP101R
#define _RP100R0 RPOR9bits.RP100R0
#define _RP100R1 RPOR9bits.RP100R1
#define _RP100R2 RPOR9bits.RP100R2
#define _RP100R3 RPOR9bits.RP100R3
#define _RP100R4 RPOR9bits.RP100R4
#define _RP100R5 RPOR9bits.RP100R5
#define _RP101R0 RPOR9bits.RP101R0
#define _RP101R1 RPOR9bits.RP101R1
#define _RP101R2 RPOR9bits.RP101R2
#define _RP101R3 RPOR9bits.RP101R3
#define _RP101R4 RPOR9bits.RP101R4
#define _RP101R5 RPOR9bits.RP101R5

/* RPOR11 */
#define _RP104R RPOR11bits.RP104R
#define _RP108R RPOR11bits.RP108R
#define _RP104R0 RPOR11bits.RP104R0
#define _RP104R1 RPOR11bits.RP104R1
#define _RP104R2 RPOR11bits.RP104R2
#define _RP104R3 RPOR11bits.RP104R3
#define _RP104R4 RPOR11bits.RP104R4
#define _RP104R5 RPOR11bits.RP104R5
#define _RP108R0 RPOR11bits.RP108R0
#define _RP108R1 RPOR11bits.RP108R1
#define _RP108R2 RPOR11bits.RP108R2
#define _RP108R3 RPOR11bits.RP108R3
#define _RP108R4 RPOR11bits.RP108R4
#define _RP108R5 RPOR11bits.RP108R5

/* RPOR12 */
#define _RP109R RPOR12bits.RP109R
#define _RP112R RPOR12bits.RP112R
#define _RP109R0 RPOR12bits.RP109R0
#define _RP109R1 RPOR12bits.RP109R1
#define _RP109R2 RPOR12bits.RP109R2
#define _RP109R3 RPOR12bits.RP109R3
#define _RP109R4 RPOR12bits.RP109R4
#define _RP109R5 RPOR12bits.RP109R5
#define _RP112R0 RPOR12bits.RP112R0
#define _RP112R1 RPOR12bits.RP112R1
#define _RP112R2 RPOR12bits.RP112R2
#define _RP112R3 RPOR12bits.RP112R3
#define _RP112R4 RPOR12bits.RP112R4
#define _RP112R5 RPOR12bits.RP112R5

/* RPOR13 */
#define _RP113R RPOR13bits.RP113R
#define _RP118R RPOR13bits.RP118R
#define _RP113R0 RPOR13bits.RP113R0
#define _RP113R1 RPOR13bits.RP113R1
#define _RP113R2 RPOR13bits.RP113R2
#define _RP113R3 RPOR13bits.RP113R3
#define _RP113R4 RPOR13bits.RP113R4
#define _RP113R5 RPOR13bits.RP113R5
#define _RP118R0 RPOR13bits.RP118R0
#define _RP118R1 RPOR13bits.RP118R1
#define _RP118R2 RPOR13bits.RP118R2
#define _RP118R3 RPOR13bits.RP118R3
#define _RP118R4 RPOR13bits.RP118R4
#define _RP118R5 RPOR13bits.RP118R5

/* RPOR14 */
#define _RP120R RPOR14bits.RP120R
#define _RP125R RPOR14bits.RP125R
#define _RP120R0 RPOR14bits.RP120R0
#define _RP120R1 RPOR14bits.RP120R1
#define _RP120R2 RPOR14bits.RP120R2
#define _RP120R3 RPOR14bits.RP120R3
#define _RP120R4 RPOR14bits.RP120R4
#define _RP120R5 RPOR14bits.RP120R5
#define _RP125R0 RPOR14bits.RP125R0
#define _RP125R1 RPOR14bits.RP125R1
#define _RP125R2 RPOR14bits.RP125R2
#define _RP125R3 RPOR14bits.RP125R3
#define _RP125R4 RPOR14bits.RP125R4
#define _RP125R5 RPOR14bits.RP125R5

/* RPOR15 */
#define _RP126R RPOR15bits.RP126R
#define _RP127R RPOR15bits.RP127R
#define _RP126R0 RPOR15bits.RP126R0
#define _RP126R1 RPOR15bits.RP126R1
#define _RP126R2 RPOR15bits.RP126R2
#define _RP126R3 RPOR15bits.RP126R3
#define _RP126R4 RPOR15bits.RP126R4
#define _RP126R5 RPOR15bits.RP126R5
#define _RP127R0 RPOR15bits.RP127R0
#define _RP127R1 RPOR15bits.RP127R1
#define _RP127R2 RPOR15bits.RP127R2
#define _RP127R3 RPOR15bits.RP127R3
#define _RP127R4 RPOR15bits.RP127R4
#define _RP127R5 RPOR15bits.RP127R5

/* RPINR0 */
#define _INT1R RPINR0bits.INT1R
#define _INT1R0 RPINR0bits.INT1R0
#define _INT1R1 RPINR0bits.INT1R1
#define _INT1R2 RPINR0bits.INT1R2
#define _INT1R3 RPINR0bits.INT1R3
#define _INT1R4 RPINR0bits.INT1R4
#define _INT1R5 RPINR0bits.INT1R5
#define _INT1R6 RPINR0bits.INT1R6

/* RPINR1 */
#define _INT2R RPINR1bits.INT2R
#define _INT3R RPINR1bits.INT3R
#define _INT2R0 RPINR1bits.INT2R0
#define _INT2R1 RPINR1bits.INT2R1
#define _INT2R2 RPINR1bits.INT2R2
#define _INT2R3 RPINR1bits.INT2R3
#define _INT2R4 RPINR1bits.INT2R4
#define _INT2R5 RPINR1bits.INT2R5
#define _INT2R6 RPINR1bits.INT2R6
#define _INT3R0 RPINR1bits.INT3R0
#define _INT3R1 RPINR1bits.INT3R1
#define _INT3R2 RPINR1bits.INT3R2
#define _INT3R3 RPINR1bits.INT3R3
#define _INT3R4 RPINR1bits.INT3R4
#define _INT3R5 RPINR1bits.INT3R5
#define _INT3R6 RPINR1bits.INT3R6

/* RPINR2 */
#define _INT4R RPINR2bits.INT4R
#define _RSVR RPINR2bits.RSVR
#define _INT4R0 RPINR2bits.INT4R0
#define _INT4R1 RPINR2bits.INT4R1
#define _INT4R2 RPINR2bits.INT4R2
#define _INT4R3 RPINR2bits.INT4R3
#define _INT4R4 RPINR2bits.INT4R4
#define _INT4R5 RPINR2bits.INT4R5
#define _INT4R6 RPINR2bits.INT4R6
#define _RSVR0 RPINR2bits.RSVR0
#define _RSVR1 RPINR2bits.RSVR1
#define _RSVR2 RPINR2bits.RSVR2
#define _RSVR3 RPINR2bits.RSVR3
#define _RSVR4 RPINR2bits.RSVR4
#define _RSVR5 RPINR2bits.RSVR5
#define _RSVR6 RPINR2bits.RSVR6

/* RPINR3 */
#define _T2CKR RPINR3bits.T2CKR
#define _T3CKR RPINR3bits.T3CKR
#define _T2CKR0 RPINR3bits.T2CKR0
#define _T2CKR1 RPINR3bits.T2CKR1
#define _T2CKR2 RPINR3bits.T2CKR2
#define _T2CKR3 RPINR3bits.T2CKR3
#define _T2CKR4 RPINR3bits.T2CKR4
#define _T2CKR5 RPINR3bits.T2CKR5
#define _T2CKR6 RPINR3bits.T2CKR6
#define _T3CKR0 RPINR3bits.T3CKR0
#define _T3CKR1 RPINR3bits.T3CKR1
#define _T3CKR2 RPINR3bits.T3CKR2
#define _T3CKR3 RPINR3bits.T3CKR3
#define _T3CKR4 RPINR3bits.T3CKR4
#define _T3CKR5 RPINR3bits.T3CKR5
#define _T3CKR6 RPINR3bits.T3CKR6

/* RPINR4 */
#define _T4CKR RPINR4bits.T4CKR
#define _T5CKR RPINR4bits.T5CKR
#define _T4CKR0 RPINR4bits.T4CKR0
#define _T4CKR1 RPINR4bits.T4CKR1
#define _T4CKR2 RPINR4bits.T4CKR2
#define _T4CKR3 RPINR4bits.T4CKR3
#define _T4CKR4 RPINR4bits.T4CKR4
#define _T4CKR5 RPINR4bits.T4CKR5
#define _T4CKR6 RPINR4bits.T4CKR6
#define _T5CKR0 RPINR4bits.T5CKR0
#define _T5CKR1 RPINR4bits.T5CKR1
#define _T5CKR2 RPINR4bits.T5CKR2
#define _T5CKR3 RPINR4bits.T5CKR3
#define _T5CKR4 RPINR4bits.T5CKR4
#define _T5CKR5 RPINR4bits.T5CKR5
#define _T5CKR6 RPINR4bits.T5CKR6

