thelemon22/regis/demo_projects/dsPIC33E/h/p33EP512MU814.h
/* CNPUG */
#define _CNPUG0 CNPUGbits.CNPUG0
#define _CNPUG1 CNPUGbits.CNPUG1
#define _CNPUG6 CNPUGbits.CNPUG6
#define _CNPUG7 CNPUGbits.CNPUG7
#define _CNPUG8 CNPUGbits.CNPUG8
#define _CNPUG9 CNPUGbits.CNPUG9
#define _CNPUG12 CNPUGbits.CNPUG12
#define _CNPUG13 CNPUGbits.CNPUG13
#define _CNPUG14 CNPUGbits.CNPUG14
#define _CNPUG15 CNPUGbits.CNPUG15

/* CNPDG */
#define _CNPDG0 CNPDGbits.CNPDG0
#define _CNPDG1 CNPDGbits.CNPDG1
#define _CNPDG6 CNPDGbits.CNPDG6
#define _CNPDG7 CNPDGbits.CNPDG7
#define _CNPDG8 CNPDGbits.CNPDG8
#define _CNPDG9 CNPDGbits.CNPDG9
#define _CNPDG12 CNPDGbits.CNPDG12
#define _CNPDG13 CNPDGbits.CNPDG13
#define _CNPDG14 CNPDGbits.CNPDG14
#define _CNPDG15 CNPDGbits.CNPDG15

/* ANSELG */
#define _ANSG6 ANSELGbits.ANSG6
#define _ANSG7 ANSELGbits.ANSG7
#define _ANSG8 ANSELGbits.ANSG8
#define _ANSG9 ANSELGbits.ANSG9

/* TRISH */
#define _TRISH0 TRISHbits.TRISH0
#define _TRISH1 TRISHbits.TRISH1
#define _TRISH2 TRISHbits.TRISH2
#define _TRISH3 TRISHbits.TRISH3
#define _TRISH4 TRISHbits.TRISH4
#define _TRISH5 TRISHbits.TRISH5
#define _TRISH6 TRISHbits.TRISH6
#define _TRISH7 TRISHbits.TRISH7
#define _TRISH8 TRISHbits.TRISH8
#define _TRISH9 TRISHbits.TRISH9
#define _TRISH10 TRISHbits.TRISH10
#define _TRISH11 TRISHbits.TRISH11
#define _TRISH12 TRISHbits.TRISH12
#define _TRISH13 TRISHbits.TRISH13
#define _TRISH14 TRISHbits.TRISH14
#define _TRISH15 TRISHbits.TRISH15

/* PORTH */
#define _RH0 PORTHbits.RH0
#define _RH1 PORTHbits.RH1
#define _RH2 PORTHbits.RH2
#define _RH3 PORTHbits.RH3
#define _RH4 PORTHbits.RH4
#define _RH5 PORTHbits.RH5
#define _RH6 PORTHbits.RH6
#define _RH7 PORTHbits.RH7
#define _RH8 PORTHbits.RH8
#define _RH9 PORTHbits.RH9
#define _RH10 PORTHbits.RH10
#define _RH11 PORTHbits.RH11
#define _RH12 PORTHbits.RH12
#define _RH13 PORTHbits.RH13
#define _RH14 PORTHbits.RH14
#define _RH15 PORTHbits.RH15

/* LATH */
#define _LATH0 LATHbits.LATH0
#define _LATH1 LATHbits.LATH1
#define _LATH2 LATHbits.LATH2
#define _LATH3 LATHbits.LATH3
#define _LATH4 LATHbits.LATH4
#define _LATH5 LATHbits.LATH5
#define _LATH6 LATHbits.LATH6
#define _LATH7 LATHbits.LATH7
#define _LATH8 LATHbits.LATH8
#define _LATH9 LATHbits.LATH9
#define _LATH10 LATHbits.LATH10
#define _LATH11 LATHbits.LATH11
#define _LATH12 LATHbits.LATH12
#define _LATH13 LATHbits.LATH13
#define _LATH14 LATHbits.LATH14
#define _LATH15 LATHbits.LATH15

/* ODCH */
#define _ODCH0 ODCHbits.ODCH0
#define _ODCH1 ODCHbits.ODCH1
#define _ODCH2 ODCHbits.ODCH2
#define _ODCH3 ODCHbits.ODCH3
#define _ODCH4 ODCHbits.ODCH4
#define _ODCH5 ODCHbits.ODCH5
#define _ODCH6 ODCHbits.ODCH6
#define _ODCH7 ODCHbits.ODCH7
#define _ODCH8 ODCHbits.ODCH8
#define _ODCH9 ODCHbits.ODCH9
#define _ODCH10 ODCHbits.ODCH10
#define _ODCH11 ODCHbits.ODCH11
#define _ODCH12 ODCHbits.ODCH12
#define _ODCH13 ODCHbits.ODCH13
#define _ODCH14 ODCHbits.ODCH14
#define _ODCH15 ODCHbits.ODCH15

/* CNENH */
#define _CNIEH0 CNENHbits.CNIEH0
#define _CNIEH1 CNENHbits.CNIEH1
#define _CNIEH2 CNENHbits.CNIEH2
#define _CNIEH3 CNENHbits.CNIEH3
#define _CNIEH4 CNENHbits.CNIEH4
#define _CNIEH5 CNENHbits.CNIEH5
#define _CNIEH6 CNENHbits.CNIEH6
#define _CNIEH7 CNENHbits.CNIEH7
#define _CNIEH8 CNENHbits.CNIEH8
#define _CNIEH9 CNENHbits.CNIEH9
#define _CNIEH10 CNENHbits.CNIEH10
#define _CNIEH11 CNENHbits.CNIEH11
#define _CNIEH12 CNENHbits.CNIEH12
#define _CNIEH13 CNENHbits.CNIEH13
#define _CNIEH14 CNENHbits.CNIEH14
#define _CNIEH15 CNENHbits.CNIEH15

/* CNPUH */
#define _CNPUH0 CNPUHbits.CNPUH0
#define _CNPUH1 CNPUHbits.CNPUH1
#define _CNPUH2 CNPUHbits.CNPUH2
#define _CNPUH3 CNPUHbits.CNPUH3
#define _CNPUH4 CNPUHbits.CNPUH4
#define _CNPUH5 CNPUHbits.CNPUH5
#define _CNPUH6 CNPUHbits.CNPUH6
#define _CNPUH7 CNPUHbits.CNPUH7
#define _CNPUH8 CNPUHbits.CNPUH8
#define _CNPUH9 CNPUHbits.CNPUH9
#define _CNPUH10 CNPUHbits.CNPUH10
#define _CNPUH11 CNPUHbits.CNPUH11
#define _CNPUH12 CNPUHbits.CNPUH12
#define _CNPUH13 CNPUHbits.CNPUH13
#define _CNPUH14 CNPUHbits.CNPUH14
#define _CNPUH15 CNPUHbits.CNPUH15

/* CNPDH */
#define _CNPDH0 CNPDHbits.CNPDH0
#define _CNPDH1 CNPDHbits.CNPDH1
#define _CNPDH2 CNPDHbits.CNPDH2
#define _CNPDH3 CNPDHbits.CNPDH3
#define _CNPDH4 CNPDHbits.CNPDH4
#define _CNPDH5 CNPDHbits.CNPDH5
#define _CNPDH6 CNPDHbits.CNPDH6
#define _CNPDH7 CNPDHbits.CNPDH7
#define _CNPDH8 CNPDHbits.CNPDH8
#define _CNPDH9 CNPDHbits.CNPDH9
#define _CNPDH10 CNPDHbits.CNPDH10
#define _CNPDH11 CNPDHbits.CNPDH11
#define _CNPDH12 CNPDHbits.CNPDH12
#define _CNPDH13 CNPDHbits.CNPDH13
#define _CNPDH14 CNPDHbits.CNPDH14
#define _CNPDH15 CNPDHbits.CNPDH15

/* TRISJ */
#define _TRISJ0 TRISJbits.TRISJ0
#define _TRISJ1 TRISJbits.TRISJ1
#define _TRISJ2 TRISJbits.TRISJ2
#define _TRISJ3 TRISJbits.TRISJ3
#define _TRISJ4 TRISJbits.TRISJ4
#define _TRISJ5 TRISJbits.TRISJ5
#define _TRISJ6 TRISJbits.TRISJ6
#define _TRISJ7 TRISJbits.TRISJ7
#define _TRISJ8 TRISJbits.TRISJ8
#define _TRISJ9 TRISJbits.TRISJ9
#define _TRISJ10 TRISJbits.TRISJ10
#define _TRISJ11 TRISJbits.TRISJ11
#define _TRISJ12 TRISJbits.TRISJ12
#define _TRISJ13 TRISJbits.TRISJ13
#define _TRISJ14 TRISJbits.TRISJ14
#define _TRISJ15 TRISJbits.TRISJ15

/* PORTJ */
#define _RJ0 PORTJbits.RJ0
#define _RJ1 PORTJbits.RJ1
#define _RJ2 PORTJbits.RJ2
#define _RJ3 PORTJbits.RJ3
#define _RJ4 PORTJbits.RJ4
#define _RJ5 PORTJbits.RJ5
#define _RJ6 PORTJbits.RJ6
#define _RJ7 PORTJbits.RJ7
#define _RJ8 PORTJbits.RJ8
#define _RJ9 PORTJbits.RJ9
#define _RJ10 PORTJbits.RJ10
#define _RJ11 PORTJbits.RJ11
#define _RJ12 PORTJbits.RJ12
#define _RJ13 PORTJbits.RJ13
#define _RJ14 PORTJbits.RJ14
#define _RJ15 PORTJbits.RJ15

/* LATJ */
#define _LATJ0 LATJbits.LATJ0
#define _LATJ1 LATJbits.LATJ1
#define _LATJ2 LATJbits.LATJ2
#define _LATJ3 LATJbits.LATJ3
#define _LATJ4 LATJbits.LATJ4
#define _LATJ5 LATJbits.LATJ5
#define _LATJ6 LATJbits.LATJ6
#define _LATJ7 LATJbits.LATJ7
#define _LATJ8 LATJbits.LATJ8
#define _LATJ9 LATJbits.LATJ9
#define _LATJ10 LATJbits.LATJ10
#define _LATJ11 LATJbits.LATJ11
#define _LATJ12 LATJbits.LATJ12
#define _LATJ13 LATJbits.LATJ13
#define _LATJ14 LATJbits.LATJ14
#define _LATJ15 LATJbits.LATJ15

/* ODCJ */
#define _ODCJ0 ODCJbits.ODCJ0
#define _ODCJ1 ODCJbits.ODCJ1
#define _ODCJ2 ODCJbits.ODCJ2
#define _ODCJ3 ODCJbits.ODCJ3
#define _ODCJ4 ODCJbits.ODCJ4
#define _ODCJ5 ODCJbits.ODCJ5
#define _ODCJ6 ODCJbits.ODCJ6
#define _ODCJ7 ODCJbits.ODCJ7
#define _ODCJ8 ODCJbits.ODCJ8
#define _ODCJ9 ODCJbits.ODCJ9
#define _ODCJ10 ODCJbits.ODCJ10
#define _ODCJ11 ODCJbits.ODCJ11
#define _ODCJ12 ODCJbits.ODCJ12
#define _ODCJ13 ODCJbits.ODCJ13
#define _ODCJ14 ODCJbits.ODCJ14
#define _ODCJ15 ODCJbits.ODCJ15

/* CNENJ */
#define _CNIEJ0 CNENJbits.CNIEJ0
#define _CNIEJ1 CNENJbits.CNIEJ1
#define _CNIEJ2 CNENJbits.CNIEJ2
#define _CNIEJ3 CNENJbits.CNIEJ3
#define _CNIEJ4 CNENJbits.CNIEJ4
#define _CNIEJ5 CNENJbits.CNIEJ5
#define _CNIEJ6 CNENJbits.CNIEJ6
#define _CNIEJ7 CNENJbits.CNIEJ7
#define _CNIEJ8 CNENJbits.CNIEJ8
#define _CNIEJ9 CNENJbits.CNIEJ9
#define _CNIEJ10 CNENJbits.CNIEJ10
#define _CNIEJ11 CNENJbits.CNIEJ11
#define _CNIEJ12 CNENJbits.CNIEJ12
#define _CNIEJ13 CNENJbits.CNIEJ13
#define _CNIEJ14 CNENJbits.CNIEJ14
#define _CNIEJ15 CNENJbits.CNIEJ15

/* CNPUJ */
#define _CNPUJ0 CNPUJbits.CNPUJ0
#define _CNPUJ1 CNPUJbits.CNPUJ1
#define _CNPUJ2 CNPUJbits.CNPUJ2
#define _CNPUJ3 CNPUJbits.CNPUJ3
#define _CNPUJ4 CNPUJbits.CNPUJ4
#define _CNPUJ5 CNPUJbits.CNPUJ5
#define _CNPUJ6 CNPUJbits.CNPUJ6
#define _CNPUJ7 CNPUJbits.CNPUJ7
#define _CNPUJ8 CNPUJbits.CNPUJ8
#define _CNPUJ9 CNPUJbits.CNPUJ9
#define _CNPUJ10 CNPUJbits.CNPUJ10
#define _CNPUJ11 CNPUJbits.CNPUJ11
#define _CNPUJ12 CNPUJbits.CNPUJ12
#define _CNPUJ13 CNPUJbits.CNPUJ13
#define _CNPUJ14 CNPUJbits.CNPUJ14
#define _CNPUJ15 CNPUJbits.CNPUJ15

/* CNPDJ */
#define _CNPDJ0 CNPDJbits.CNPDJ0
#define _CNPDJ1 CNPDJbits.CNPDJ1
#define _CNPDJ2 CNPDJbits.CNPDJ2
#define _CNPDJ3 CNPDJbits.CNPDJ3
#define _CNPDJ4 CNPDJbits.CNPDJ4
#define _CNPDJ5 CNPDJbits.CNPDJ5
#define _CNPDJ6 CNPDJbits.CNPDJ6
#define _CNPDJ7 CNPDJbits.CNPDJ7
#define _CNPDJ8 CNPDJbits.CNPDJ8
#define _CNPDJ9 CNPDJbits.CNPDJ9
#define _CNPDJ10 CNPDJbits.CNPDJ10
#define _CNPDJ11 CNPDJbits.CNPDJ11
#define _CNPDJ12 CNPDJbits.CNPDJ12
#define _CNPDJ13 CNPDJbits.CNPDJ13
#define _CNPDJ14 CNPDJbits.CNPDJ14
#define _CNPDJ15 CNPDJbits.CNPDJ15

/* TRISK */
#define _TRISK0 TRISKbits.TRISK0
#define _TRISK1 TRISKbits.TRISK1
#define _TRISK11 TRISKbits.TRISK11
#define _TRISK12 TRISKbits.TRISK12
#define _TRISK13 TRISKbits.TRISK13
#define _TRISK14 TRISKbits.TRISK14
#define _TRISK15 TRISKbits.TRISK15

/* PORTK */
#define _RK0 PORTKbits.RK0
#define _RK1 PORTKbits.RK1
#define _RK11 PORTKbits.RK11
#define _RK12 PORTKbits.RK12
#define _RK13 PORTKbits.RK13
#define _RK14 PORTKbits.RK14
#define _RK15 PORTKbits.RK15

/* LATK */
#define _LATK0 LATKbits.LATK0
#define _LATK1 LATKbits.LATK1
#define _LATK11 LATKbits.LATK11
#define _LATK12 LATKbits.LATK12
#define _LATK13 LATKbits.LATK13
#define _LATK14 LATKbits.LATK14
#define _LATK15 LATKbits.LATK15

/* ODCK */
#define _ODCK0 ODCKbits.ODCK0
#define _ODCK1 ODCKbits.ODCK1
#define _ODCK11 ODCKbits.ODCK11
#define _ODCK12 ODCKbits.ODCK12
#define _ODCK13 ODCKbits.ODCK13
#define _ODCK14 ODCKbits.ODCK14
#define _ODCK15 ODCKbits.ODCK15

/* CNENK */
#define _CNIEK0 CNENKbits.CNIEK0
#define _CNIEK1 CNENKbits.CNIEK1
#define _CNIEK11 CNENKbits.CNIEK11
#define _CNIEK12 CNENKbits.CNIEK12
#define _CNIEK13 CNENKbits.CNIEK13
#define _CNIEK14 CNENKbits.CNIEK14
#define _CNIEK15 CNENKbits.CNIEK15

